app/controllers/ideas_controller.rb

  def index
    @platforms = Platform.all
    if params[:order] == "asc"
      @ideas = Idea.all.order(name: :asc)
    elsif params[:order] == "desc"
      @ideas = Idea.all.order(name: :desc)
    elsif params[:order] == "oldest"
      @ideas = Idea.all.order(created_at: :asc)
---
SELECT "platforms".* FROM "platforms"
SELECT "ideas".* FROM "ideas"  ORDER BY "ideas"."created_at" DESC

  def create
    @idea = current_user.ideas.create(idea_params.merge({ role_ids: params[:idea][:role_ids].map{ |v| v.to_i } }))

    respond_to do |format|
      if @idea.errors.blank?
        @idea.ideas_users.first.update(action_type: IdeasUser.action_types[:owner])
---
INSERT INTO "ideas" ("name", "description", "additional_info", "platform_id", "role_ids", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT  "ideas_users".* FROM "ideas_users" WHERE "ideas_users"."idea_id" = ?  ORDER BY "ideas_users"."id" ASC LIMIT 1  [["idea_id", 1]]
UPDATE "ideas_users" SET "action_type" = ? WHERE "ideas_users"."id" = ?  [["action_type", 0], ["id", 1]]

    def set_roles
      @roles = Role.all
---
SELECT "roles".* FROM "roles"