app/controllers/visitors_controller.rb

SELECT "platforms".* FROM "platforms"
SELECT "ideas".* FROM "ideas"  ORDER BY "ideas"."created_at" DESC
SELECT "roles".* FROM "roles"
---
  def index
    @platforms = Platform.all
    if params[:order] == "asc"
      @ideas = Idea.all.order(name: :asc)
    elsif params[:order] == "desc"
      @ideas = Idea.all.order(name: :desc)
    elsif params[:order] == "oldest"
      @ideas = Idea.all.order(created_at: :asc)
    else
      @ideas = Idea.all.order(created_at: :desc)
    end

    @ideas = @ideas.where(platform_id: params[:platform_id]) if params[:platform_id]
    @roles = Role.all